{
    "fr": {
      "welcome": "Bienvenue chez DANDJIN DREDGING CONSTRUCTION",
      "tagline": "Experts en construction, dragage et travaux maritimes",
      "discoverServices": "Découvrir nos services",
      "services": "Nos Services",
      "dragageText": "Travaux de curage, nettoyage de ports, fleuves et lacs.",
      "constructionText": "Ouvrages solides : routes, berges, quais maritimes, etc.",
      "transportText": "Services de logistique portuaire, affrètement, et transport de marchandises par voie navigable.",
      "about": "À propos de Dandjin",
      "about1": "DANDJIN est une entreprise innovante spécialisée dans le dragage, la vente de sable...",
      "about2": "Nos opérations sont guidées par l'excellence, la durabilité et l'innovation.",
      "trustedBy": "Ils nous font confiance",
      "testimonial1": "Travail impeccable pour notre projet de port...",
      "testimonial2": "Sable de qualité supérieure livré rapidement...",
      "testimonial3": "Dandjin nous accompagne depuis plusieurs années...",
      "home": "Accueil",
      "about": "À propos",
      "services": "Services",
      "contact": "Contactez-nous",
      "search": "Rechercher...",
      "about_title": "À propos - Dandjin",
      "about_heading": "À propos de Dandjin",
      "about_intro1": "DANDJIN DEPTH DREDGING AND CONSTRUCTION LTD est une entreprise innovante, implantée à Keta (Ghana), spécialisée dans le dragage de sable, la construction d’infrastructures et le développement urbain durable. Créée pour répondre à la demande croissante en matériaux de construction tout en respectant les normes environnementales, Dandjin se positionne comme un acteur engagé dans la transformation éco-responsable du territoire.",
      "about_intro2": "Notre principal projet se situe dans la lagune de Kedzikope, une zone stratégique riche en sable de haute qualité. Nous menons des opérations de dragage modernes et responsables, tout en planifiant la création d’un pôle urbain multifonctionnel alliant espaces résidentiels, centres commerciaux et zones de loisirs. Ce projet vise à faire de Keta une destination de développement économique et social majeure dans la région.",
      "mission_title": "Notre mission",
      "mission_text": "Nous nous engageons à offrir des services de dragage et de construction de haute qualité, respectueux de l’environnement, adaptés aux besoins des communautés locales et conformes aux exigences réglementaires. Nos interventions visent à valoriser les ressources naturelles de manière durable tout en générant de l’emploi et en soutenant les initiatives de développement communautaire.",
      "vision_title": "Notre vision",
      "vision_text": "Devenir une référence mondiale dans le domaine du dragage écologique et des constructions durables. Nous plaçons l’innovation, la technologie et la responsabilité sociale au cœur de notre stratégie pour construire des infrastructures utiles, modernes et harmonieuses avec leur environnement.",
      "offers_title": "Nos offres",
      "offers_text": "Découvrez nos opportunités de recrutement et devenez partenaire. Pour plus de détails, cliquez ici :",
      "commitments_title": "Nos engagements",
      "commit_quality": "Qualité : une exigence permanente pour garantir la satisfaction de nos clients et partenaires.",
      "commit_durability": "Durabilité : des méthodes de dragage et de construction respectueuses des écosystèmes.",
      "commit_local": "Développement local : création d’emplois, valorisation des talents locaux et amélioration des conditions de vie.",
      "commit_innovation": "Innovation : adoption de technologies modernes pour optimiser l’efficacité et la sécurité de nos opérations.",
      "commit_transparency": "Transparence : une gestion éthique, claire et rigoureuse dans tous nos projets.",
      "future_title": "Un projet porteur d’avenir",
      "future_text1": "Au-delà du dragage, Dandjin ambitionne de faire émerger à Keta une cité intelligente. Le remblaiement du site permettra la création d’un centre résidentiel, commercial et de divertissement de classe mondiale. Grâce à des infrastructures modernes, des espaces verts, et une intégration technologique intelligente, nous contribuons à bâtir une nouvelle vision de l’aménagement du territoire.",
      "future_text2": "Nous collaborons avec des universités, des startups technologiques et des ONG locales pour intégrer les meilleures pratiques et les dernières innovations. Notre approche est holistique, mêlant ingénierie, urbanisme, et impact social positif.",
      "closing_text": "Bienvenue chez Dandjin — là où l’innovation rencontre l’action durable.",
      "offers_link": "recrutements-partenaires",
      "share": "Partager :",
      "services_title": "Nos Services",
        "dragage_title": "Dragage de sable",
        "dragage_text": "Extraction responsable de sable lagunaire de haute qualité...",
        "vente_sable_title": "Vente de sable",
        "vente_sable_text": "Distribution de sable fin purifié destiné à divers projets de construction et d'infrastructure.",
        "construction_title": "Construction",
        "construction_text": "Réalisation d'ouvrages solides : routes, quais, berges et infrastructures urbaines durables.",
        "amenagement_title": "Aménagement urbain",
        "amenagement_text": "Création de cités modernes sur zones remblayées avec logements, commerces et loisirs.",
        "transport_title": "Transport maritime",
        "transport_text": "Développement de voies navigables pour le transport sécurisé de personnes et marchandises.",
        "developpement_title": "Développement durable",
        "developpement_text": "Protection de l’environnement, lutte contre l’érosion, gestion des ressources naturelles.",
        "impact_title": "Impact communautaire",
        "impact_text": "Création d’emplois, formation locale et partenariats avec ONG, startups et universités.",
        "vente_terrain_title": "Vente de terrains",
        "vente_terrain_text": "Commercialisation de parcelles stratégiques dans une cité urbaine en développement.",
        "dragage_title": "Dragage de sable - Dandjin",
        "dragage_para1": "Chez <strong>DANDJIN DREDGING DEPTH & CONSTRUCTION LTD</strong>, nous sommes des experts dans les travaux de <strong>dragage lagunaire et maritime</strong>, avec des années d'expérience dans l'exécution de projets d'envergure. Nous mettons un point d'honneur à utiliser des équipements de dernière génération pour effectuer chaque opération de manière efficace et sécurisée. Nos technologies de dragage avancées nous permettent de travailler dans des conditions difficiles tout en minimisant l'impact environnemental de nos activités. Nous respectons strictement les normes <strong>nationales et internationales</strong> en matière de protection de l'environnement, garantissant ainsi que toutes nos opérations sont réalisées de manière responsable.",
        "dragage_para2": "Le sable que nous extrayons est soumis à un processus minutieux de <strong>tri, lavage et purification</strong> pour garantir une qualité optimale. Ce processus assure que le sable est parfaitement adapté à une large gamme de projets de <strong>construction</strong>, d’<strong>aménagement urbain</strong>, ainsi que d'<strong>infrastructures routières et portuaires</strong>. Nous sommes particulièrement fiers de fournir un matériau qui répond aux exigences techniques les plus strictes, tout en étant conforme aux standards environnementaux. Ce sable, une fois nettoyé et purifié, devient un matériau de construction fiable, durable et idéal pour une utilisation dans les grands projets d’infrastructure.",
        "dragage_para3": "Nos équipes de professionnels qualifiés interviennent dans des environnements variés, qu'ils soient maritimes, fluviaux ou lacustres, et sont équipées pour réaliser des interventions dans des zones souvent difficiles d'accès. En combinant expertise technique et expérience locale, nous garantissons un service <strong>rapide</strong>, <strong>sécurisé</strong> et <strong>durable</strong>. Chaque opération est réalisée avec une <strong>précision optimale</strong>, en tenant compte de la sécurité des zones d’intervention et de la protection des écosystèmes environnants. Nous utilisons des techniques de dragage avancées qui garantissent une extraction optimale, tout en préservant les habitats naturels et en limitant la dégradation des berges.",
        "dragage_para4": "Une de nos principales réussites est notre intervention continue au <strong>Ghana</strong>, où nous avons réalisé plusieurs opérations de dragage pour améliorer les voies navigables et faciliter l’approvisionnement en sable de haute qualité pour des projets de grande envergure. Ce processus est essentiel pour soutenir le <strong>développement économique</strong> de la région en permettant une meilleure circulation maritime et fluviale, essentielle pour le transport de marchandises et la sécurité des voies navigables.",
        "dragage_para5": "Grâce à notre expertise technique et à nos <strong>partenariats stratégiques</strong> avec des entreprises et institutions locales, nous avons réussi à contribuer activement à l’entretien des voies navigables et à la protection des berges naturelles. Nous participons également au développement d’infrastructures portuaires et maritimes modernes, qui sont cruciales pour soutenir la croissance du secteur du transport et du commerce dans toute la région ouest-africaine.",
        "dragage_para6": "Notre engagement ne se limite pas seulement à la fourniture de sable de qualité. Nous nous efforçons également de renforcer la <strong>fluidité du transport maritime</strong>, facilitant ainsi les échanges commerciaux dans la région. Nous jouons un rôle clé dans le soutien au développement des infrastructures maritimes, permettant ainsi de contribuer à l’amélioration des conditions économiques et sociales de toute la sous-région.",
        "dragage_para7": "Au cœur de notre vision, il y a un <strong>engagement durable</strong> et responsable envers le développement des infrastructures africaines. Chez <strong>DANDJIN DREDGING DEPTH & CONSTRUCTION LTD</strong>, nous croyons fermement que chaque projet doit être conduit dans le respect absolu des normes sociales et environnementales. Cela signifie que nous nous engageons à fournir des ressources extraites de manière responsable, en évitant la surexploitation des ressources naturelles et en soutenant les initiatives de <strong>réhabilitation écologique</strong>.",
        "dragage_para8": "Nos pratiques de dragage ne sont pas seulement orientées vers la rentabilité économique, mais aussi vers la <strong>préservation des écosystèmes locaux</strong>. Par exemple, nous mettons en œuvre des techniques qui permettent de réduire l'impact des travaux de dragage sur la faune et la flore aquatiques, tout en favorisant la <strong>régénération des zones impactées</strong> par nos activités. Nous sommes convaincus que le développement durable doit être au cœur de toutes nos opérations et nous œuvrons pour que les bénéfices de nos projets soient partagés avec les communautés locales tout en assurant la préservation de l'environnement.",
        "dragage_para9": "Intervenant principalement au <strong>Bénin</strong>, au <strong>Ghana</strong> et dans toute la <strong>sous-région ouest-africaine</strong>, <strong>DANDJIN DREDGING DEPTH & CONSTRUCTION LTD</strong> est devenu un acteur clé du <strong>développement des projets maritimes et fluviaux</strong> dans cette région dynamique. Nos interventions visent à soutenir les projets de développement économique, notamment ceux liés à l’amélioration des infrastructures portuaires, au développement du secteur de la construction et à la création de nouvelles voies de transport.",
        "btn_home": "← Retour à l'accueil",
        "btn_services": "← Voir tous les services",
        "dragage_img_alt": "Opération de dragage de sable au Ghana",
        "contact.title": "Contactez-Nous",
        "contact.city": "Cotonou, Bénin",
        "contact.phone": "+229 90 00 00 00",
        "contact.fullname": "Nom complet",
        "contact.email": "Adresse e-mail",
        "contact.message": "Votre message",
        "contact.send": "Envoyer",
        "contact.placeholder.name": "Votre nom",
        "contact.placeholder.email": "exemple@gmail.com",
        "contact.placeholder.message": "Écrivez votre message ici..."
        

    },
    "en": {
      "welcome": "Welcome to DANDJIN DREDGING CONSTRUCTION",
      "tagline": "Experts in construction, dredging and maritime works",
      "discoverServices": "Discover our services",
      "services": "Our Services",
      "dragageText": "Dredging operations, port cleaning, rivers and lakes maintenance.",
      "constructionText": "Solid structures: roads, banks, maritime quays, etc.",
      "transportText": "Port logistics services, freight and waterway transport.",
      "about": "About Dandjin",
      "about1": "DANDJIN is an innovative company specialized in dredging, sand sales...",
      "about2": "Our operations are driven by excellence, sustainability and innovation.",
      "trustedBy": "Our Clients Trust Us",
      "testimonial1": "Excellent work on our port project...",
      "testimonial2": "Top quality sand delivered quickly...",
      "testimonial3": "Dandjin has supported us for years...",
      "home": "Home",
      "about": "About",
      "services": "Services",
      "contact": "Contact Us",
      "search": "Search...",
      "about_title": "About - Dandjin",
      "about_heading": "About Dandjin",
      "about_intro1": "DANDJIN DEPTH DREDGING AND CONSTRUCTION LTD is an innovative company based in Keta (Ghana), specializing in sand dredging, infrastructure construction, and sustainable urban development. Created to meet the growing demand for construction materials while respecting environmental standards, Dandjin positions itself as a committed player in eco-responsible territorial transformation.",
      "about_intro2": "Our main project is located in the Kedzikope lagoon, a strategic area rich in high-quality sand. We conduct modern and responsible dredging operations while planning the creation of a multifunctional urban hub combining residential spaces, shopping centers, and leisure areas. This project aims to make Keta a major hub of economic and social development in the region.",
      "mission_title": "Our Mission",
      "mission_text": "We are committed to providing high-quality dredging and construction services that are environmentally friendly, tailored to the needs of local communities, and compliant with regulatory requirements. Our interventions aim to sustainably enhance natural resources while creating jobs and supporting community development initiatives.",
      "vision_title": "Our Vision",
      "vision_text": "To become a global reference in ecological dredging and sustainable construction. We place innovation, technology, and social responsibility at the heart of our strategy to build useful, modern, and environmentally harmonious infrastructures.",
      "offers_title": "Our Opportunities",
      "offers_text": "Discover our recruitment opportunities and become a partner. For more details, click here:",
      "commitments_title": "Our Commitments",
      "commit_quality": "Quality: a constant requirement to ensure the satisfaction of our clients and partners.",
      "commit_durability": "Sustainability: dredging and construction methods that respect ecosystems.",
      "commit_local": "Local development: job creation, promotion of local talents, and improvement of living conditions.",
      "commit_innovation": "Innovation: adoption of modern technologies to optimize the efficiency and safety of our operations.",
      "commit_transparency": "Transparency: ethical, clear, and rigorous management in all our projects.",
      "future_title": "A Project for the Future",
      "future_text1": "Beyond dredging, Dandjin aims to establish a smart city in Keta. The land reclamation will allow for the creation of a world-class residential, commercial, and entertainment center. With modern infrastructure, green spaces, and smart technology integration, we are building a new vision of land use planning.",
      "future_text2": "We collaborate with universities, tech startups, and local NGOs to integrate best practices and the latest innovations. Our approach is holistic, combining engineering, urban planning, and positive social impact.",
      "closing_text": "Welcome to Dandjin — where innovation meets sustainable action.",
      "share": "Share:",
      "offers_link": "recruitment-partners",
      "services_title": "Our Services",
        "dragage_title": "Sand Dredging",
        "dragage_text": "Responsible extraction of high-quality lagoon sand...",
        "vente_sable_title": "Sand Sales",
        "vente_sable_text": "Distribution of fine purified sand for various construction and infrastructure projects.",
        "construction_title": "Construction",
        "construction_text": "Construction of solid structures: roads, docks, embankments, and sustainable urban infrastructure.",
        "amenagement_title": "Urban Development",
        "amenagement_text": "Creation of modern cities on reclaimed land with housing, shops, and leisure areas.",
        "transport_title": "Maritime Transport",
        "transport_text": "Development of waterways for the safe transport of people and goods.",
        "developpement_title": "Sustainable Development",
        "developpement_text": "Environmental protection, erosion control, and natural resource management.",
        "impact_title": "Community Impact",
        "impact_text": "Job creation, local training, and partnerships with NGOs, startups, and universities.",
        "vente_terrain_title": "Land Sales",
        "vente_terrain_text": "Marketing of strategic plots in a developing urban city.",
        "dragage_title": "Sand Dredging - Dandjin",
        "dragage_para1": "At <strong>DANDJIN DREDGING DEPTH & CONSTRUCTION LTD</strong>, we are experts in <strong>lagoon and maritime dredging</strong> works, with years of experience in executing large-scale projects. We take pride in using state-of-the-art equipment to carry out each operation efficiently and safely. Our advanced dredging technologies allow us to work in challenging conditions while minimizing the environmental impact of our activities. We strictly adhere to <strong>national and international</strong> environmental protection standards, ensuring that all our operations are carried out responsibly.",
        "dragage_para2": "The sand we extract undergoes a meticulous process of <strong>sorting, washing, and purification</strong> to ensure optimal quality. This process ensures that the sand is perfectly suited for a wide range of <strong>construction</strong>, <strong>urban development</strong>, and <strong>road and port infrastructure</strong> projects. We are particularly proud to provide a material that meets the strictest technical requirements while being in compliance with environmental standards. Once cleaned and purified, this sand becomes a reliable, durable construction material ideal for use in large infrastructure projects.",
        "dragage_para3": "Our team of qualified professionals operates in a variety of environments, whether marine, riverine, or lacustrine, and is equipped to perform interventions in often difficult-to-reach areas. By combining technical expertise and local experience, we guarantee a <strong>fast</strong>, <strong>safe</strong>, and <strong>sustainable</strong> service. Every operation is carried out with <strong>optimal precision</strong>, taking into account the safety of the intervention areas and the protection of surrounding ecosystems. We use advanced dredging techniques that ensure optimal extraction while preserving natural habitats and minimizing bank degradation.",
        "dragage_para4": "One of our main successes is our ongoing intervention in <strong>Ghana</strong>, where we have carried out several dredging operations to improve navigable waterways and facilitate the supply of high-quality sand for large-scale projects. This process is vital for supporting the <strong>economic development</strong> of the region by enabling better maritime and river circulation, which is essential for the transportation of goods and the safety of navigable routes.",
        "dragage_para5": "With our technical expertise and <strong>strategic partnerships</strong> with local businesses and institutions, we have actively contributed to the maintenance of navigable waterways and the protection of natural banks. We also participate in the development of modern port and maritime infrastructure, which is crucial for supporting the growth of the transport and trade sectors throughout the West African region.",
        "dragage_para6": "Our commitment goes beyond just providing quality sand. We also strive to enhance the <strong>fluidity of maritime transport</strong>, thereby facilitating trade exchanges in the region. We play a key role in supporting the development of maritime infrastructure, thus contributing to the improvement of economic and social conditions throughout the sub-region.",
        "dragage_para7": "At the heart of our vision is a <strong>sustainable</strong> and responsible commitment to the development of African infrastructure. At <strong>DANDJIN DREDGING DEPTH & CONSTRUCTION LTD</strong>, we firmly believe that every project must be carried out with the utmost respect for social and environmental standards. This means we are committed to providing responsibly extracted resources, avoiding the over-exploitation of natural resources, and supporting <strong>ecological rehabilitation</strong> initiatives.",
        "dragage_para8": "Our dredging practices are not only focused on economic profitability but also on the <strong>preservation of local ecosystems</strong>. For example, we implement techniques that reduce the impact of dredging operations on aquatic wildlife while promoting the <strong>regeneration of impacted areas</strong> by our activities. We are convinced that sustainable development should be at the core of all our operations, and we strive to ensure that the benefits of our projects are shared with local communities while ensuring environmental preservation.",
        "dragage_para9": "Operating primarily in <strong>Benin</strong>, <strong>Ghana</strong>, and throughout the <strong>West African sub-region</strong>, <strong>DANDJIN DREDGING DEPTH & CONSTRUCTION LTD</strong> has become a key player in the <strong>development of maritime and river projects</strong> in this dynamic region. Our interventions aim to support economic development projects, particularly those related to the improvement of port infrastructure, the construction sector, and the creation of new transport routes.",
        "btn_home": "← Back to Home",
        "btn_services": "← View All Services",
        "dragage_img_alt": "Sand dredging operation in Ghana",
        "contact.title": "Contact Us",
        "contact.city": "Cotonou, Benin",
        "contact.phone": "+229 90 00 00 00",
        "contact.fullname": "Full Name",
        "contact.email": "Email Address",
        "contact.message": "Your Message",
        "contact.send": "Send",
        "contact.placeholder.name": "Your name",
        "contact.placeholder.email": "example@gmail.com",
        "contact.placeholder.message": "Write your message here..."
        
    }
  }
  